
&НаСервере
&После("ПриСозданииНаСервере")
Процедура ВИ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Поле формы "ВИ_ВнешняяИнструкция"
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("ВИ_ВнешняяИнструкция", 
												Тип("ПолеФормы"), 
												ЭтотОбъект.Элементы.ГруппаОсновныхРеквизитов, 
												ЭтотОбъект.Элементы.Активна);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеПереключателя;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным = "Объект.ВИ_ВнешняяИнструкция";
	НовыйЭлемент.ВидФлажка = ВидФлажка.Выключатель;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ВИ_ВнешняяИнструкцияПриИзмененииПосле");

	// Поле формы "ВИ_АдресВнешнейИнструкции"
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("ВИ_АдресВнешнейИнструкции", 
												Тип("ПолеФормы"), 
												ЭтотОбъект.Элементы.ГруппаОсновныхРеквизитов, 
												ЭтотОбъект.Элементы.Активна);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВИ_АдресВнешнейИнструкции";
	
	Элементы.ВИ_АдресВнешнейИнструкции.Видимость = Объект.ВИ_ВнешняяИнструкция;
	
КонецПроцедуры

&НаКлиенте
Процедура ВИ_ВнешняяИнструкцияПриИзмененииПосле(Элемент)
	
	Элементы.ВИ_АдресВнешнейИнструкции.Видимость = Объект.ВИ_ВнешняяИнструкция;
	
КонецПроцедуры
