////////////////////////////////////////////////////////////////////////////////
// Работа с HTML (вызов сервера).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Кодирует переданную ссылку.
//
// Параметры:
//  Ссылка - Строка - Ссылка.
// 
// Возвращаемое значение:
//  Строка - Кодированная ссылка.
//
Функция КодироватьСсылку(Ссылка) Экспорт
	
	Возврат КодироватьСтроку(Ссылка, СпособКодированияСтроки.URLВКодировкеURL);
	
КонецФункции

// Получает ссылку на объект по навиг сслке
Функция СсылкаПоНавигационной(НавигационнаяСсылкаОтбора) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИД = Прав(СокрЛП(НавигационнаяСсылкаОтбора), 32);
	ИД = Сред(ИД, 25, 8)
		+ "-" + Сред(ИД, 21, 4)
		+ "-" + Сред(ИД, 17, 4)
		+ "-" + Сред(ИД, 1,  4)
		+ "-" + Сред(ИД, 5,  12);
		
	Имя = Сред(НавигационнаяСсылкаОтбора, СтрНайти(НавигационнаяСсылкаОтбора, "/", НаправлениеПоиска.СКонца) + 1);
	Имя = Лев(Имя, СтрНайти(Имя, "?") - 1);
	
	Попытка
		Возврат ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Имя).ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции


#КонецОбласти