
&ИзменениеИКонтроль("ОткрытьСсылку")
Процедура ПереходПоСсылкам_ОткрытьСсылку(Href, Element, HTMLДокумент)

	ВыбраннаяСсылка = Неопределено;

	Если Href <> Неопределено Тогда
		// Если у данных события заполнено свойство Href - будем считать что переход будет по этой ссылке
		ВыбраннаяСсылка = Href;
	Иначе
		Попытка
			// Если у элемента события заполнено свойство Href и элемент AREA - будем считать что переход
			// будет по этой ссылке.
			Если ВРег(Element.tagName) = "AREA" Тогда
				ВыбраннаяСсылка = Element.Href;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	Если ПустаяСтрока(ВыбраннаяСсылка) Тогда
		Возврат;
	КонецЕсли;
#Вставка
	Если ПереходПоСсылкам_ПерейтиПоВстроеннойСсылке(HTMLДокумент, ВыбраннаяСсылка) Тогда
		Возврат;
	КонецЕсли;
#КонецВставки
	#Если ВебКлиент Тогда
		Если Найти(ВыбраннаяСсылка, "javascript:_1c") = 1 Тогда

			// FF - используется javascript такого вида
			ПозицияНавигационнойСсылки = Найти(ВыбраннаяСсылка, "e1cib/");

			Если ПозицияНавигационнойСсылки <> 0 Тогда
				ВыбраннаяСсылка = 
				"v8doc:" 
				+ Сред(
				ВыбраннаяСсылка, 
				ПозицияНавигационнойСсылки, 
				СтрДлина(ВыбраннаяСсылка) - ПозицияНавигационнойСсылки - 2);
			Иначе
				СтандартнаяОбработка = Истина;
				Возврат;
			КонецЕсли;

		КонецЕсли;

		ПозицияРазделителя = Найти(ВыбраннаяСсылка, "#");
		ПозицияВнутреннейНавигационнойСсылки = Найти(ВыбраннаяСсылка, "#e1cib/");

		Если ПозицияРазделителя = 1  Тогда

			// Safari - передается просто относительная ссылка
			СтандартнаяОбработка = Истина;
			Возврат;

		КонецЕсли;

		Если Найти(ВыбраннаяСсылка, ПолучитьНавигационнуюСсылкуИнформационнойБазы()) = 1 Тогда

			// Chrome, IE - передаётся полная ссылка
			Если ПозицияРазделителя <> 0 И ПозицияВнутреннейНавигационнойСсылки = 0 Тогда

				СтандартнаяОбработка = Истина;
				Возврат;

			КонецЕсли;

		КонецЕсли;

	#Иначе
		Если Найти(ВыбраннаяСсылка, ПолучитьНавигационнуюСсылкуИнформационнойБазы()) = 1 Тогда

			ElementID = Сред(ВыбраннаяСсылка, Найти(ВыбраннаяСсылка, "#") + 1);
			ElementByID = HTMLДокумент.getElementById(ElementID);

			Если ElementByID <> Неопределено Тогда
				ElementByID.scrollIntoView(true);
				Возврат;
			КонецЕсли;

		КонецЕсли;
	#КонецЕсли

	СхемаСсылки = ОпределитьСхемуСсылки(ВыбраннаяСсылка);

	Если СхемаСсылки = "v8doc:" Тогда

		ОбработатьСсылку1СДокументооборота(ВыбраннаяСсылка, HTMLДокумент);

	ИначеЕсли СхемаСсылки = "e1c://" 
		ИЛИ (СхемаСсылки = "http://" И Найти(ВыбраннаяСсылка, "e1cib") > 0)
		ИЛИ (СхемаСсылки = "https://" И Найти(ВыбраннаяСсылка, "e1cib") > 0) Тогда

		ПерейтиПоНавигационнойСсылке(ВыбраннаяСсылка);

	ИначеЕсли СхемаСсылки = "http://"
		Или СхемаСсылки = "https://"
		Или СхемаСсылки = "ftp://"
		Или СхемаСсылки = "file://" Тогда

		#Если ВебКлиент Тогда
			ПерейтиПоНавигационнойСсылке(ВыбраннаяСсылка);
		#Иначе
			ЗапуститьПриложение(ВыбраннаяСсылка);
		#КонецЕсли

	Иначе

		ПерейтиПоНавигационнойСсылке(ВыбраннаяСсылка);

	КонецЕсли;

КонецПроцедуры

Функция ПереходПоСсылкам_ПерейтиПоВстроеннойСсылке(HTMLДокумент, ВыбраннаяСсылка) Экспорт
	
	Попытка
		
		ПозицияРазделителя = СтрНайти(ВыбраннаяСсылка, "#");
		АдресБазы = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
		
		Если ПозицияРазделителя = 1
			Или (ПозицияРазделителя <> 0
				И СтрНайти(ВыбраннаяСсылка, АдресБазы) = 1)
			Или (ПозицияРазделителя <> 0
				И СтрНайти(ВыбраннаяСсылка, "%") <> 0
				И СтрНайти(ВыбраннаяСсылка, ПереходПоСсылкам_HTMLВызовСервера.КодироватьСсылку(АдресБазы)) = 1) Тогда
			
			TargetHref = Сред(ВыбраннаяСсылка, ПозицияРазделителя + 1);
			TargetElement = HTMLДокумент.getElementById(TargetHref);
			Если TargetElement = Неопределено Тогда
				
				ElementsByName = HTMLДокумент.getElementsByName(TargetHref);
				Если ElementsByName.length > 0 Тогда
					TargetElement = ElementsByName["0"];
				КонецЕсли;
				
			КонецЕсли;
			
			Если TargetElement <> Неопределено Тогда
				TargetElement.scrollIntoView(true);
				Возврат Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		// В некоторых случаях что-то могло пойти не так, например на Mac.
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции
